package class_2022_08_5;
//来自Amazon
//定义一个概念叫"变序最大和"
//"变序最大和"是说一个数组中，每个值都可以减小或者不变，
//在必须把整体变成严格升序的情况下，得到的最大累加和
//比如，[1,100,7]变成[1,6,7]时，就有变序最大和为14
//比如，[5,4,9]变成[3,4,9]时，就有变序最大和为16
//比如，[1,4,2]变成[0,1,2]时，就有变序最大和为3
//给定一个数组arr，其中所有的数字都是>=0的
//求arr所有子数组的变序最大和中，最大的那个并返回
//1 <= arr长度 <= 10^6
//0 <= arr[i] <= 10^6
//
//给定n棵树，和两个长度为n的数组a和b
//i号棵树的初始重量为a[i]，i号树每天的增长重量为b[i]
//你每天最多能砍1棵树，这天收益 = 砍的树初始重量 + 砍的树增长到这天的总增重
//给定m，表示你有m天，返回m天内你获得的最大收益
//本题测试链接 : https://zoj.pintia.cn/problem-sets/91827364500/problems/91827367873
public class Code03_SubarrayMakeSrotedMaxSum {
}
