package class_2022_12_2;
//有100个犯人被关在监狱里，编号0~99
//监狱长构思了一个处决犯人的计划
//监狱长准备了100个盒子，每个盒子里面装有一个犯人的名字
//一开始每个犯人都知道自己的盒子在哪
//因为自己的编号，与盒子的编号一致，
//这100个盒子排成一排，放在一个房间里面，盒子编号0~99，从左到右排列
//监狱长彻底随机的打乱了盒子的排列，并且犯人并没有看到打乱的过程
//监狱长规定，每个犯人依次进入房间，每个犯人都可以开启50个盒子，然后关上
//每一个犯人全程无法进行任何交流，完全无法传递任何信息
//监狱长规定，每个犯人在尝试50次的过程中，都需要找到自己的名字
//如果有哪怕一个犯人没有做到这一点，100个罪犯全部处决
//但是监狱长允许这个游戏开始之前，所有犯人在一起商量策略
//请尽量制定一个让所有人存活概率最大的策略
//来自论文<The Cell Probe Complexity of Succinct Data Structures>
//作者Anna Gal和Peter Bro Miltersen写于2007年
//如今该题变成了流行科普视频，我们来玩一玩
public class Code01_PrisonersEscapeGame {
}
