package class_2022_02_4;
//给你一个下标从 0 开始的字符串数组 words 。每个字符串都只包含 小写英文字母 
//words 中任意一个子串中，每个字母都至多只出现一次。
//如果通过以下操作之一，我们可以从 s1 的字母集合得到 s2 的字母集合，那么我们称这两个字符串为 关联的 ：
//往 s1 的字母集合中添加一个字母。从 s1 的字母集合中删去一个字母
//将 s1 中的一个字母替换成另外任意一个字母（也可以替换为这个字母本身）。
//数组 words 可以分为一个或者多个无交集的 组 。如果一个字符串与另一个字符串关联，那么它们应当属于同一个组
//你需要确保分好组后，一个组内的任一字符串与其他组的字符串都不关联。可以证明在这个条件下，分组方案是唯一的
//请你返回一个长度为 2 的数组 ans ：
//ans[0] 是 words 分组后的 总组数 。
//ans[1] 是字符串数目最多的组所包含的字符串数目。
//leetcode链接 : https://leetcode.com/problems/groups-of-strings/
public class Code05_GroupsOfStrings {
}
