package class_2022_10_4;
//来自拼多多
//第一行有一个正整数n(3<=n<=100000)，代表小A拟定的路线数量
//第二行有n个正整数，第i个代表第i条路线的起始日期
//第三行有n个正整数，第i个代表第i条路线的终止日期
//输入保证起始日期小于终止日期
//日期最小是1，最大不超过1000000000
//小A打算选三个路线进行旅游，比如 A -> B -> C
//要求A的结束日期要小于B的开始日期，B的结束日期要小于C的开始日期
//输出一个非负整数，代表线路的方案数量
//例子
//输入
//6
//4 1 3 2 1 2
//4 1 3 3 2 2
//输出
//6
//解释
//[1,1] -> [2,2] -> [3,3]
//[1,1] -> [2,2] -> [4,4]
//[1,1] -> [2,3] -> [4,4]
//[1,2] -> [3,3] -> [4,4]
//[1,1] -> [3,3] -> [4,4]
//[2,2] -> [3,3] -> [4,4]
public class Code04_NumberOfIncreasingRoadsThree {
}
