package class_2023_04_4;
//开心一下的智力题 :
//有一个村庄，一共250人
//每一个村民要么一定说谎，要么只说真话
//村里有A、B、C、D四个球队，且每个村民只会喜欢其中的一支球队
//但是说谎者会不告知真实喜好，而且会说是另外三支球队的支持者（全支持另外三支球队）
//访问所有的村民之后，得到的访谈结果如下 :
//A的支持者有90
//B的支持者有100
//C的支持者有80
//D的支持者有80
//问村里有多少个说谎者
//下面是正式题 :
//你有一个凸的 n 边形，其每个顶点都有一个整数值。给定一个整数数组 values ，
//其中 values[i] 是第 i 个顶点的值（即 顺时针顺序 ）。
//假设将多边形 剖分 为 n - 2 个三角形。
//对于每个三角形，该三角形的值是顶点标记的乘积，
//三角剖分的分数是进行三角剖分后所有 n - 2 个三角形的值之和。
//返回 多边形进行三角剖分后可以得到的最低分 。
//测试链接 : https://leetcode.cn/problems/minimum-score-triangulation-of-polygon/
public class Code02_MinScoreTriangulationPolygon {
}
