package class_2023_05_4;
//来自招商银行
//原始题目描述
//假如某公司目前推出了N个在售的金融产品(1[=N&lt;=100)
//对于张三，用ai表示他购买了ai(0&lt;=ai&lt;=10^4)份额的第i个产品(1&lt;=i&lt;=N)
//现给出K(1&lt;=K&lt;=N)个方案，通过这些方案，能够支持将多个不同的产品进行整合
//(也可以对单个产品进行优化)形成新的产品。
//新的产品形成后，若用户持有了组成新产品所需的全部的原产品份额，
//则能够将用户持有的原产品份额转换为新产品的份额，各原产品份额与新产品份额比例均为1:1
//我们保证对于每个产品最多存在一个方案使用旧产品整合成该产品
//并且根据方案产出的新产品的产品编号均大于各旧产品的产品编号
//现计划根据这些方案，帮助部分愿意升级到最新产品的用户对产品进行升级
//请协助工作人员计算当前用户能够转换出的最新产品份额的最大值
//输入描述
//第一行包含整数N，第二行包含N个整数ai，第三行包含整数K
//接下来的K行，每一行代表一个方案，每一行包含整数1和M(M](=N%3C=100)%0A%E5%AF%B9%E4%BA%8E%E5%BC%A0%E4%B8%89%EF%BC%8C%E7%94%A8ai%E8%A1%A8%E7%A4%BA%E4%BB%96%E8%B4%AD%E4%B9%B0%E4%BA%86ai(0%3C=ai%3C=10%5E4)%E4%BB%BD%E9%A2%9D%E7%9A%84%E7%AC%ACi%E4%B8%AA%E4%BA%A7%E5%93%81(1%3C=i%3C=N)%0A%E7%8E%B0%E7%BB%99%E5%87%BAK(1%3C=K%3C=N)%E4%B8%AA%E6%96%B9%E6%A1%88%EF%BC%8C%E9%80%9A%E8%BF%87%E8%BF%99%E4%BA%9B%E6%96%B9%E6%A1%88%EF%BC%8C%E8%83%BD%E5%A4%9F%E6%94%AF%E6%8C%81%E5%B0%86%E5%A4%9A%E4%B8%AA%E4%B8%8D%E5%90%8C%E7%9A%84%E4%BA%A7%E5%93%81%E8%BF%9B%E8%A1%8C%E6%95%B4%E5%90%88%0A(%E4%B9%9F%E5%8F%AF%E4%BB%A5%E5%AF%B9%E5%8D%95%E4%B8%AA%E4%BA%A7%E5%93%81%E8%BF%9B%E8%A1%8C%E4%BC%98%E5%8C%96)%E5%BD%A2%E6%88%90%E6%96%B0%E7%9A%84%E4%BA%A7%E5%93%81%E3%80%82%0A%E6%96%B0%E7%9A%84%E4%BA%A7%E5%93%81%E5%BD%A2%E6%88%90%E5%90%8E%EF%BC%8C%E8%8B%A5%E7%94%A8%E6%88%B7%E6%8C%81%E6%9C%89%E4%BA%86%E7%BB%84%E6%88%90%E6%96%B0%E4%BA%A7%E5%93%81%E6%89%80%E9%9C%80%E7%9A%84%E5%85%A8%E9%83%A8%E7%9A%84%E5%8E%9F%E4%BA%A7%E5%93%81%E4%BB%BD%E9%A2%9D%EF%BC%8C%0A%E5%88%99%E8%83%BD%E5%A4%9F%E5%B0%86%E7%94%A8%E6%88%B7%E6%8C%81%E6%9C%89%E7%9A%84%E5%8E%9F%E4%BA%A7%E5%93%81%E4%BB%BD%E9%A2%9D%E8%BD%AC%E6%8D%A2%E4%B8%BA%E6%96%B0%E4%BA%A7%E5%93%81%E7%9A%84%E4%BB%BD%E9%A2%9D%EF%BC%8C%E5%90%84%E5%8E%9F%E4%BA%A7%E5%93%81%E4%BB%BD%E9%A2%9D%E4%B8%8E%E6%96%B0%E4%BA%A7%E5%93%81%E4%BB%BD%E9%A2%9D%E6%AF%94%E4%BE%8B%E5%9D%87%E4%B8%BA1:1%0A%E6%88%91%E4%BB%AC%E4%BF%9D%E8%AF%81%E5%AF%B9%E4%BA%8E%E6%AF%8F%E4%B8%AA%E4%BA%A7%E5%93%81%E6%9C%80%E5%A4%9A%E5%AD%98%E5%9C%A8%E4%B8%80%E4%B8%AA%E6%96%B9%E6%A1%88%E4%BD%BF%E7%94%A8%E6%97%A7%E4%BA%A7%E5%93%81%E6%95%B4%E5%90%88%E6%88%90%E8%AF%A5%E4%BA%A7%E5%93%81%0A%E5%B9%B6%E4%B8%94%E6%A0%B9%E6%8D%AE%E6%96%B9%E6%A1%88%E4%BA%A7%E5%87%BA%E7%9A%84%E6%96%B0%E4%BA%A7%E5%93%81%E7%9A%84%E4%BA%A7%E5%93%81%E7%BC%96%E5%8F%B7%E5%9D%87%E5%A4%A7%E4%BA%8E%E5%90%84%E6%97%A7%E4%BA%A7%E5%93%81%E7%9A%84%E4%BA%A7%E5%93%81%E7%BC%96%E5%8F%B7%0A%E7%8E%B0%E8%AE%A1%E5%88%92%E6%A0%B9%E6%8D%AE%E8%BF%99%E4%BA%9B%E6%96%B9%E6%A1%88%EF%BC%8C%E5%B8%AE%E5%8A%A9%E9%83%A8%E5%88%86%E6%84%BF%E6%84%8F%E5%8D%87%E7%BA%A7%E5%88%B0%E6%9C%80%E6%96%B0%E4%BA%A7%E5%93%81%E7%9A%84%E7%94%A8%E6%88%B7%E5%AF%B9%E4%BA%A7%E5%93%81%E8%BF%9B%E8%A1%8C%E5%8D%87%E7%BA%A7%0A%E8%AF%B7%E5%8D%8F%E5%8A%A9%E5%B7%A5%E4%BD%9C%E4%BA%BA%E5%91%98%E8%AE%A1%E7%AE%97%E5%BD%93%E5%89%8D%E7%94%A8%E6%88%B7%E8%83%BD%E5%A4%9F%E8%BD%AC%E6%8D%A2%E5%87%BA%E7%9A%84%E6%9C%80%E6%96%B0%E4%BA%A7%E5%93%81%E4%BB%BD%E9%A2%9D%E7%9A%84%E6%9C%80%E5%A4%A7%E5%80%BC%0A%E8%BE%93%E5%85%A5%E6%8F%8F%E8%BF%B0%0A%E7%AC%AC%E4%B8%80%E8%A1%8C%E5%8C%85%E5%90%AB%E6%95%B4%E6%95%B0N%EF%BC%8C%E7%AC%AC%E4%BA%8C%E8%A1%8C%E5%8C%85%E5%90%ABN%E4%B8%AA%E6%95%B4%E6%95%B0ai%EF%BC%8C%E7%AC%AC%E4%B8%89%E8%A1%8C%E5%8C%85%E5%90%AB%E6%95%B4%E6%95%B0K%0A%E6%8E%A5%E4%B8%8B%E6%9D%A5%E7%9A%84K%E8%A1%8C%EF%BC%8C%E6%AF%8F%E4%B8%80%E8%A1%8C%E4%BB%A3%E8%A1%A8%E4%B8%80%E4%B8%AA%E6%96%B9%E6%A1%88%EF%BC%8C%E6%AF%8F%E4%B8%80%E8%A1%8C%E5%8C%85%E5%90%AB%E6%95%B4%E6%95%B01%E5%92%8CM(M)=1)
//L为该方案产生的新产品的编号，M代表方案所需原产品个数
//接下来的M个整数代表了该方案所需的每个原产品的个数
//输出描述
//根据日前的份额和给出的方案，经过若干次转换，输出当前用户能够得到产品N的份额最大值
//举例
//输入:
//5
//2 0 0 1 0
//3
//5 2 3 4
//2 1 1
//3 1 2
//输出:
//1
//解释:
//第一步将1份1产品转化为1份2产品
//第二步将1份2产品转化为1份3产品
//第三步将1份3产品和1份4产品，转成为1份5产品
//然后不能得到更多的5产品了，所以返回1
//实在是太困惑了，上文说的意思可谓不做人，那么我们改写一下意思，变得好理解
//如下是改写后的题目描述
//给定一个数组arr，长度为n，产品编号从0~n-1
//arr[i]代表初始时i号产品有多少份
//存在一系列的产品转化方案的数组convert，长度为k，代表k个方案
//比如具体某一个方案，convert[j] = {a, b, c, d, ...}
//表示当前的j号方案转化出来的产品是a，转化1份a需要：1份b、1份c、1份d...
//其中a、b、c、d...一定都在0~n-1范围内
//并且题目保证a > Math.max(b, c, d, ....)
//而且题目保证所有方案转化出来的产品编号一定是不重复的
//请返回最终能得到的第n-1号商品的最大值
//1 <= n <= 100
//0 <= arr[i] <= 10^4
//k < n
public class Code06_ConversionOfFinancialProducts {
}
